from Levenshtein import ratio
from functools import reduce
from parsivar import Normalizer
from typing import Any

class TjPersChecker:
    _tj_let = 'б г д з з з к л м н п р с с с т ф х ч ж ш ғ қ ҳ ҷ'.split()
    _pers_let = [Normalizer().normalize(x) for x in 'ب گ د ﺽ ﺫ ﺯ ک ل م ن پ ر ﺙ ﺹ ﺱ ﺕ ف خ چ ژ ش غ ق ه ج'.split()]

    @staticmethod
    def str_changer(tokens: str, lang: str) -> str:
        changed_str = []
        if lang == "tj":
            for l in tokens:
                if l.lower() in TjPersChecker._tj_let:
                    changed_str.append(l.lower())
        elif lang == "pers":
            for l in tokens:
                if l in TjPersChecker._pers_let:
                    l = TjPersChecker._tj_let[TjPersChecker._pers_let.index(l)]
                    changed_str.append(l)
        return "".join(changed_str)

    @staticmethod
    def check(tj_sentence: str, pers_sentence: str) -> float:
        return ratio(TjPersChecker.str_changer(tj_sentence, lang="tj"), TjPersChecker.str_changer(pers_sentence, lang="pers"))
    
    @staticmethod
    def check_lists(tj_sentences: 'list[str]', pers_sentences: 'list[str]') -> 'list[float]':
        return [TjPersChecker.check(tj_sentence=tj_sen, pers_sentence=per_sen) for tj_sen, per_sen in zip(tj_sentences, pers_sentences)]
    
    @staticmethod
    def match_sentances(tj_sentences: 'list[str]', pers_sentences: 'list[str]') -> 'list[dict[str, Any]]':
        """
        Сопоставление любого количества предложений в любом порядке предложений.
        Ищутся предложения с максимальным совпадением.
        На выходе массив объектов формата {'tj': предложение на таджикском, 'pers' : предложение на персидском, 'match' : схожесть }
        """
        matched_sentances = []
        is_tj_less = len(pers_sentences) > len(tj_sentences)
        main_sentances = tj_sentences if is_tj_less else pers_sentences
        second_sentances = pers_sentences if is_tj_less else tj_sentences
        for sentance in main_sentances:
          matched_sentence = reduce(lambda sp_a, sp_b: sp_a if sp_a['match'] > sp_b['match'] else sp_b, [  # type: ignore
            {
              'pers' if is_tj_less else 'tj' : sec_sentence, 
              'match' : 
                TjPersChecker.check(tj_sentence=sentance, pers_sentence=sec_sentence) if is_tj_less else 
                TjPersChecker.check(tj_sentence=sec_sentence, pers_sentence=sentance)
            } 
            for sec_sentence in second_sentances
          ])
          matched_sentances.append({'tj' if is_tj_less else 'pers' : sentance, **matched_sentence})       # type: ignore
        return matched_sentances
            

if __name__ == '__main__':
    
    pers_equals_sentences = [
        'شواهد تازه نشان می دهد که اشخاصی که در روز چندین فنجان چای یا قهوه می نوشند کمتر احتمال دارد به بیماری های قلبی مبتلا شوند',
        'این شواهد حاصل سیزده سال مطالعه بر روی چهل هزار نفر در هلند است',
        'بنا بر گزارشی که در این باره در نشریه پزشکی American Heart Association انتشار یافته، در کسانی که در روز بیش از شش فنجان چای می نوشند، خطر ابتلا به بیماری های قلبی یک سوم کاهش می یابد',
        'مصرف قهوه نیز تا حدودی به کاهش احتمال مبتلا شدن به ناراحتی های قلبی کمک می کند',
        'خطر مبتلا شدن به بیماری های قلبی در کسانی که روزانه دو تا چهار فنجان قهوه می نوشند، در مقایسه با کسانی که عادت به نوشیدن قهوه ندارند، بیست در صد کمتر است',
        'کشیدن سیگار تاثیر مثبت نوشیدن چای و قهوه را از بین می برد',
        'ولی اثر مثبت نوشیدن چای و قهوه در صورت مصرف بیش از اندازه از بین می رود',
        'علاوه بر این کشیدن سیگار نیز تمام اثرات مثبت چای و قهوه را خنثی می کند',
        'هلندی ها عادت دارند قهوه خود را با کمی شیر و چای را برخلاف بریتانیایی ها بدون شیر بنوشند',
        'تهیه کنندگان گزارش در مورد این که آیا شیر تاثیر فلاونوید را کاهش می دهد یا نه به نتیجه قاطعی نرسیده اند',
        'تصور می رود ماده فلاونوید موجود در چای، عامل اصلی در کاهش خطر ابتلا به بیمارهای قلبی است',
        'ولی قهوه دارای موادی است که می تواند همزمان این خطر را کاهش یا افزایش دهد چون از یک سو قادر است به طور بالقوه، میزان کلسترول خون را بالا ببرد و در همین حال از خطر التهاب که با بیماری قلبی ارتباط داده شده، بکاهد',
        'الین میسون، از بنیاد قلب بریتانیا می گوید: "مطالعات به عمل آمده تقویت کننده این فرضیه است که نوشیدن قهوه و چای در حد متعارف، برای بیشتر مردم بی ضرر است و حتی خطر ابتلا به بیماری قلبی یا مرگ در اثر این بیماری را کاهش می دهد',
        'الین میسون می افزاید: " ولی کشیدن یک سیگار همراه با قهوه، تمام این منافع را از بین می برد. علاوه بر این بعید به نظر می رسد که نوشیدن مقدار زیادی چای در حالی که شخص ساعت ها روی صندلی راحتی لم داده و تلویزیون تماشا می کند، به محفاظت از قلب کمک چندانی بکند',
        'چای و قهوه خطر بیماری های قلبی را کاهش می دهد',
    ]

    tajik_equals_sentences = [
        'Чой ва қаҳва хатари бемориҳои қалбиро коҳиш медиҳад',
        'Шавоҳиди тоза нишон медиҳад, ки ашхосе, ки дар рӯз чандин финҷон чой ё қаҳва менӯшанд, камтар эҳтимол дорад ба бемории қалбӣ мубтало шаванд',
        'Ин шавоҳид ҳосили сенздаҳ соли мутолеъа бар рӯйи чиҳил ҳазор нафар дар Ҳуланд аст',
        'Бино бар гузорише, ки дар ин бора дар нашрияи пизишкии American Heart Association интишор ёфта дар касоне ки дар рӯзбеш аз шаш финҷон чой менӯшад, хатари ибтило ба бемориҳои қалбӣ як севум коҳиш меёбад',
        'Масрафи қаҳва низ то ҳудуде ба коҳиши эҳтимоли мубтало шудан ба нороҳатиҳои қалбӣ кумак мекунад',
        'Хатари мубтало шудан ба бемориҳои қалбӣ дар касоне, ки рӯзона ду то чаҳор финҷон қаҳва менӯшанд, дар муқоиса бо касоне, ки одат ба нӯшидани қаҳва надоранд, бист дарсад камтар аст',
        'Кашидани сигор таъсири мусбати нӯшидани чой ва қаҳваро аз байн мебарад',
        'Вале асари мусбати нӯшидани чой ва қаҳва дар сурати масрафи беш аз андоза аз байн меравад',
        'Илова бар ин кашидани сигор низ тамоми асароти мусбати чой ва қаҳваро хунсо мекунад',
        'Ҳуландиҳо одат доранд қаҳваи худро бо каме шир ва чойро бар хилофи бритониё бидуни шир бинӯшанд',
        'Таҳиякунандагони гузориш дар мавриди ин, ки оё шир таъсири антиоксидант-полифенолро коҳиш медиҳад ё на ба натиҷаи қотеъе нарасидаанд',
        'Тасаввур меравад моддаи антиоксидант-полифенол дар чой, омили аслӣ дар коҳиши хатари ибтило ба бемориҳои қалбӣ аст',
        'Вале қаҳва дорои маводде аст, ки метавонад ҳамзамон ин хатарро коҳиш ё афзоиш диҳад, чун аз як сӯ қодир аст ба таври билқувва, мизони кулеструл (холестрол)-и хунро боло бибиарад ва дар ҳамин ҳол аз хатари илтиҳоб, ки бо бемории қалбӣ иртибот дода шуда, бикоҳад',
        'Эллен Мейсон, аз бунёди қалби Бритониё мегӯяд: “Мутолеъоти ба амал омада тақвияткунандаи ин фарзия аст, ки нӯшидани қаҳва ва чой дар ҳадди мутаъориф барои бештари мардум безарар аст ва ҳатто хатари ибтило ба бемории қалбӣ ё марг дар асари ин бемориро коҳиш медиҳад',
        'Эллен Мейсон меафзояд: “Вале кашидани як сигор ҳамроҳ бо қаҳва тамоми ин манофеъро аз байн мебарад. Илова бар ин баъид ба назр мерасад, ки нӯшидани миқдори зиёде чой дар ҳоле ки шахс соъатҳо рӯйи сандалии роҳате лам дода ва телевизиюн тамошо мекунад ба муҳофизат аз қалб кумаки чандоне бикунад'
    ]

    print(TjPersChecker.check_lists(tj_sentences=tajik_equals_sentences, pers_sentences=pers_equals_sentences))

    print(TjPersChecker.str_changer(tajik_equals_sentences[4], lang='tj'))
    print(TjPersChecker.str_changer(pers_equals_sentences[4], lang='pers'))

    tajik_not_equals_sentence = [
        'Дарз кардани садҳо акси хусусии бозигарон ва чеҳраҳои саршинос дар шабакаи интернет як бори дигар мизони эманӣ ва эътимод ба сервисҳои бойгонии интернетиро, ки аз онҳо барои ба иштирок гузоштани аксҳои корбарон истифода мешавад, ба миён овардааст',
        'Дар айни ҳол дар зеҳни бисёре аз мардум ин саволро ба вуҷуд оварда, ки чи гуна метавон аз афтодан ба доми сориқини акс ва иттилоъот пешгирӣ кард. Аз чӣ тариқ ва бо чӣ иқдомоте метавон аз аксҳои худ муҳофизат кард ва аз сирқат ва интишори беравияи он рӯйи шабакаи интернет ҷилавгирӣ кард',
        'Уливер Крофтун, муассиси ширкати Силикейт текнулуҷӣ, ки хадамоти фановарии ҷадид бо зариби амниятии болоро ба муштариёни пулдор ва машҳур ироа медиҳад, мегӯяд: "Муҳимтарин нукта интихоби исми рамзи (пороль) беҳтар аст. Бо таваҷҷуҳ ба таҷрибае, ки аз мавориди қаблии ҳак шудани иттилоъот дорем метавон гуфт, ки нуқтаи заъфи аслӣ заъиф будани исми рамз аст."',
        'Интихоби исми рамзе, ки кашф кардан ва ё ҳадс задани он сода аст ва ё истифода аз як исми рамзи воҳид барои сервисҳои мутафовит дар иртибототи диҷитол ба муҳоҷимон ин имконро медиҳад, ки ба ҳисоби корбарии як фард дар сафаҳоти мухталифи интернет ва ё шабакаҳои иҷтимоии гуногун русух кунанд.',
        'Уливер Крофтун меафзояд: "Онҳо ба одресҳои имейли ин афрод русух мекунанд ва баъд бо раҳгирӣ ва дунбол кардани равиши марсум дар ин сойтҳо барои тағйир додани исми рамз, иттилоъоти ҷадиде ба он дода ва метавонанд ба сафаҳоти имейли ин афрод саркашӣ кунанд."',
        'Ӯ мегӯяд, ки муштариёни ширкати ӯ ҳаддиақал як моҳ якбор бо онҳо тамос гирифта ва мегӯянд, ки дар сафҳаи имейли худ як дархости аҷиб барои тағйири исми рамз мушоҳида кардаанд. Ба эҳтимоли зиёд ин маворид нишон медиҳанд, ки касе қасд дорад ба сафҳаи имейл ва иртибототи он-лайни онҳо русух кунад.',
        'Ба гуфтаи Кин Мунру, як коршиноси эмании интернет аз муассисаи шуракои Пентест ин навъи ҳамалот ба корбарони пулдор ва машҳур ва ё корбарони маъмулиро метавон бо истифода аз сервиси муассисоте, ки ду омил барои ташхиси ҳуввияти воқеии корбарон дар назар мегиранд, хунсо кард.',
        'Ин сервисҳо барои тамос бо корбарон ба ҳангоми интиқоли иттилоъоти ҳассос мисли тағйир додани исми рамз ва ё мавориде, ки корбарон аз як компютери дигар мехоҳанд ба сафҳаи худ ворид шаванд ба ҷои ирсоли имейл аз ирсоли паёмак ба телефуни мубойли онҳо истифода мекунанд.',
        'Кин Мунру меафзояд: "Магар ин ки касе комилан ба сафҳаи шахсии имейли шумо нуфуз карда бошад. Вале дар ғайри ин сурат бо истифода аз ду равиши иртиботии мутафовит ва дар назар гирифтани ду муаллифа барои ташхиси ҳуввияти корбарон баъид аст касе битавонад ба ҳарими он-лайни шумо нуфуз кунад."',
        'Ӯ мегӯяд, ки ба ҳангоми раду бадал кардани тасовири хусусӣ бояд шарти ақл ва эҳтиётро риоят кард. Ӯ меафзояд: "Мантиқӣ аст ки мардум дӯст доранд ҳарими он-лайни онҳо муҳтарам ва маҳфуз бошад. Вале агар касе намехоҳад, ки акси хусусиашро дигарон бубинанд, шояд роҳи муассиртар ин аст, ки худаш ба хубӣ аз онҳо муҳофизат кунад."',
        'Талаи шуҳрат',
        'Уливер Крофтун, муассиси ширкати Силикейт текнулужӣ мегӯяд ҳадс задан ва кашфи исми рамзи афроди машҳур кори чандон душворе нест, чун иттилоъоти бисёр зиёде дар мавриди зиндагии онҳо аланӣ аст.',
        'Чун шуҳрат ба суръат аз роҳ мерасад, тамоми иттилоъоти марбут ба зиндагии ин афрод, ки як замоне ба хотири ношинос будани онҳо хусусӣ буд, якбора аз тариқи вебсойтҳои махсуси ғайбат ва шойиъасозӣ дар мавриди афроди машҳур аланӣ мешаванд.',
        'Уливер Крофтун меафзояд: "Мо дар миёни муштариёни ширкати худ теъдоди зиёде футболисти саршинос дорем, ки бастани як қарордоди ҷадид метавонад зиндагии онҳоро зеру рӯ кунад. Эманӣ ва ҳифозат аз иттилоъоти шахсӣ охирин чизе аст, ки ин афрод ба он фикр мекунанд. Ин варзишкорон маъмулан барои умуре мисли молиёт, пасандози бонкӣ ва ҳатто эманӣ ва ҳифозати шахсии худ мушовироне доранд, вале ба назар мерасад, ки ба эмании иттилоъот аслан таваҷҷуҳ намекунанд."',
        'Дақиқан ба ҳамин тартиб баррасии фаъолиятҳои он-лайни ҳар корбар метавонад иттилоъоти зиёдеро дар мавриди он фард, одот ва алойиқи ӯ бармало кунад ва аз рӯйи ин иттилоъот шояд битавон ҳадс зад, ки онҳо аз чӣ калимоте барои сохтани исми рамзи худи истифода мекунанд.',
        'Аз рӯйи исми рамзҳое, ки маъмулан рӯйи шабакаи интернет мушобеҳи ҳам аз об дармеоянд, метавон дид, ки маъмултарин равиши сохтани исми рамз истифода аз номи фарзандон, ҳайвоноти хонагӣ ва ё тимҳои варзишии мавриди алоқа аст. Аксари муассисоте, ки ки хадамоти интернетӣ ироа медиҳанд аз ҳамин навъи иттилоъот барои ташхиси ҳуввият ба ҳангоми тағйир додани исми рамз истифода мекунанд.',
        'Бо ин ҳама Уливер Крофтун мегӯяд, ки дар бархе аз мавориди ҳак барои кашфи исми рамзи афрод талоши бисёр зиёде мекунанд. Ӯ меафзояд: " Як мавриди мушобеҳи таҳоҷуми ахири ҳак ҳудуди 18 моҳ пеш иттифоқ афтод. Дар он маврид фарди ҳакер барои пайдо кардани исми рамзи шарики тиҷории худ тамоми вебсойти ӯро муталошӣ карда буд."',
        'Боргузории огоҳона',
        'Ҷеймз Лин, коршиноси аршади эмании интернет дар муассисаи Суфус мегӯяд, ки як исми рамзи қавӣ бояд ҳаддиақал 14 карактар (аломат) дошта бошад, вале мардум ба сахтӣ ба истифода аз исми рамзҳои тӯлонӣ одат мекунанд. Ӯ меафзояд: " Ҳатто қонеъ кардани аксарияти мардум ба истифода аз исми рамзҳо бо 8 карактар ҳам сода нест."',
        'Чӣ гуна аз иттилоъоти худ дар бойгониҳои интернетӣ муҳофизат кунед',
    ]

    persian_not_equals_sentence = [
        'آنچه باید در مورد اشکال نرم‌افزاری هارت‌بلید بدانید',
        'هفته گذشته معلوم شد که ممکن است در اثر یک اشکال امنیتی عمده در اینترنت در دو سال گذشته اطلاعات شخصی و رمزهای عبور کاربران را در اختیار هکرها قرار گرفته باشد.',
        'هنوز معلوم نیست این نقص نرم‌افزاری تا چه حد مورد استفاده قرار گرفته است، اما آنچه مسلم است این است که این نقص یکی از بزرگترین مسائل امنیتی است که اینترنت تاکنون با آن مواجه بوده است. بروس اشنایر، کارشناس امنیتی، این اشکال را "فاجعه‌بار" می‌داند و درباره وخامت آن می‌گوید: "بین ۱ تا ۱۰ به آن نمره ۱۱ می‌دهم." بی‌بی‌سی تلاش کرده آنچه باید در این باره بدانید را جمع‌آوری کند.',
        'اشکال نرم‌افزاری هارت‌بلید چیست؟',
        'این اشکال در بخشی از یک نرم‌افزار اوپن‌سورس (منبع‌باز) بنام OpenSSL وجود دارد که برای رمزگذاری ارتباطات میان کامپیوتر یک کاربر و سرور اینترنت طراحی شده، و در واقع نوعی آشنایی دادن در ابتدای یک مکالمه ایمن است.',
        'نام خونریزی قلبی (هارت‌بلید) از آن جهت به آن داده شده که بر یکی از ضمائم SSL تأثیر می‌گذارد که مهندسان به آن نام ضربان قلب داده اند. این یکی از رایج‌ترین ابزارهای رمزگذاری در اینترنت است و تصور می‌شود که حدود دوسوم وب‌سایت‌ها از آن استفاده می‌کنند.',
        'اگر در صفحه مرورگرتان علامت یک قفل کوچک را می‌بینید، به احتمال زیاد از SSL استفاده می‌کنید. تصور می‌شود که این اشکال نرم‌افزاری نیم‌میلیون وب‌سایت را تحت تأثیر خود قرار داده باشد.',
        'بروس اشنایر در وبلاگ خود نوشته: "اشکال نرم‌افزاری هارت‌بلید به هرکسی اجازه می‌دهد حافظه سیستم‌هایی که با نسخه‌های آسیب‌پذیر نرم‌افزار OpenSSL محافظت می‌شوند را بخواند. این کار کلیدهای مخفی مورد استفاده برای شناسایی ارائه‌کنندگان خدمات و رمزگذاری مبادلات، نام و رمز عبورهای کاربران را در معرض خطر قرار می‌دهد. به این ترتیب مهاجمان می‌توانند ارتباطات را شنود کنند و داده‌ها را بدزدند، و هویت خدمات و کاربران را جعل کنند." این اشکال نرم‌افزاری آنقدر جدی است که وب‌سایتی مخصوص آن راه‌اندازی شده که در آن به همه جنبه‌های مشکل پرداخته می‌شود.',
        'آیا لازم است رمز عبور خود را تغییر دهم؟',
        'بعضی کارشناسان امنیتی می‌گویند که انجام این کار دوراندیشانه است. البته بر سر اینکه آیا انجام آن لازم است – و اگر اینطور است، چه زمانی باید انجام شود – اختلاف نظر وجود دارد.',
        'بسیاری از شرکت‌های فناوری بزرگ، از جمله فیس‌بوک و گوگل، این نقطه ضعف را برطرف کرده اند. دوروتی چو، سخنگوی گوگل، گفت: "کاربران گوگل نیازی به تغییر رمز عبورهایشان ندارند." یک منبع در داخل شرکت گوگل به بی‌بی‌سی گفت که این شرکت مشکل را پیش از علنی شدن آن برطرف کرده، و اعتقاد ندارد که به‌صورت گسترده از سوی هکرها مورد استفاده قرار گرفته باشد. برخی اشاره می‌کنند که وب‌سایت‌های کوچکی بسیاری هستند که هنوز به این مسأله رسیدگی نکرده اند، و ضرر تغییر رمز عبور از سوی کاربران این وب‌سایت‌ها از فایده‌اش بیشتر است، چرا که هم رمز قدیمی و هم رمز جدید را برای هکرهای احتمالی آشکار می‌کند.',
        'با این وجود، میکو هیپونن، از مدیران شرکت امنیتی اف- سکیور، می‌گوید: "از رمزهای عبوری که برایتان مهمند، مواظبت کنید. شاید بهتر باشد الان آنها را عوض کنید، شاید هم بهتر باشد یک هفته دیگر تغییرشان دهید. اگر هم نگران کارت‌های اعتباری‌تان هستید، قبض‌های کارت‌های اعتباری‌تان را به‌دقت بررسی کنید."',
        'چگونه مطمئن شوم که رمز عبورم قوی است؟',
        'مسأله به رمز عبورهای ضعیف مربوط نمی‌شد، اما فراخوان‌هایی برای تعیین رمز عبورهای جدید به‌راه افتاده است. پروفسور وودوارد، کارشناس امنیت اینترنتی، می‌گوید که مردم باید مرتبا رمزهای عبورشان را تغییر دهند، و باید مطمئن شوند که عبارتی را به‌عنوان رمز عبور انتخاب می‌کنند که به خودشان مربوط نمی‌شود. مثلا نام حیوان خانگی گزینه مناسبی نیست. کلماتی که در فرهنگ‌های لغات وجود دارند مناسبند. البته بهتر است از ترکیبی از کلمات و اعداد استفاده شود.,',
        'بعضی شرکت‌ها هم جایگزین‌هایی برای رمزهای عبور ارائه می‌کنند. شرکت‌های سازنده تلفن همراه، از جمله اپل و سامسونگ، دستگاه‌های خواننده اثر انگشت را به تلفن‌های خود اضافه کرده اند. این گزینه به کاربران امکان می‌دهد تنها با کشیدن انگشتشان روی صفحه تلفن به خود دستگاه و بعضی کارکردهای آن دسترسی پیدا کنند.',
        'چه سایت‌هایی تحت تاثیر قرار گرفته‌اند؟',
        'گفته می‌شود که نزدیک به تیم میلیون وب سایت ممکن است در برابر این اشکال نرم افزاری آسیب پذیر باشند. تعداد این سایت‌ها به حدی زیاد است که فهرست کردن آنها کار سختی خواهد بود. سایت شرکت امنیتی کاسپرسکی، کاربران را به سایتی هدایت می‌کند که در آن می‌توانند بفهمند کدام سایت هنوز ایراد دارد.',
        'فیسبوک و گوگل گفته‌اند که اقدامات کافی برای مراقبت از کاربران انجام داده‌اند اما به گفته شرکت‌های امنیت کامپیوتری هنوز سایت‌هایی مثل فلیکر آسیب پذیر هستند.',
        'یکی از سایت‌هایی که به گفته شرکت‌های کامپیوتری آسیب پذیر بوده، یاهو است اما این سایت هم اکنون گفته که اقدامات کافی را انجام داده است',
        'بدترین سناریوی ممکن چیست؟',
        'به گفته شرکت امنیت کامپیوتری کاسپرسکی، خبر بد این است که "استفاده از اشکال نرم‌افزاری هارت‌بلید هیچ رد پایی از خود بجا نمی‌گذارد، و در نتیجه هیچ راهی وجود ندارد که با قاطعیت بگوییم یک سرور هک شده و یا چه نوع داده‌هایی از آن به سرقت رفته است."'
    ]

    print(TjPersChecker.check_lists(tj_sentences=tajik_not_equals_sentence, pers_sentences=persian_not_equals_sentence))


    pers_equals_sentences_shuffled = [
        'شواهد تازه نشان می دهد که اشخاصی که در روز چندین فنجان چای یا قهوه می نوشند کمتر احتمال دارد به بیماری های قلبی مبتلا شوند',
        'این شواهد حاصل سیزده سال مطالعه بر روی چهل هزار نفر در هلند است',
        'چای و قهوه خطر بیماری های قلبی را کاهش می دهد',
        'بنا بر گزارشی که در این باره در نشریه پزشکی American Heart Association انتشار یافته، در کسانی که در روز بیش از شش فنجان چای می نوشند، خطر ابتلا به بیماری های قلبی یک سوم کاهش می یابد',
        'مصرف قهوه نیز تا حدودی به کاهش احتمال مبتلا شدن به ناراحتی های قلبی کمک می کند',
        'خطر مبتلا شدن به بیماری های قلبی در کسانی که روزانه دو تا چهار فنجان قهوه می نوشند، در مقایسه با کسانی که عادت به نوشیدن قهوه ندارند، بیست در صد کمتر است',
        'کشیدن سیگار تاثیر مثبت نوشیدن چای و قهوه را از بین می برد',
        'ولی اثر مثبت نوشیدن چای و قهوه در صورت مصرف بیش از اندازه از بین می رود',
        'علاوه بر این کشیدن سیگار نیز تمام اثرات مثبت چای و قهوه را خنثی می کند',
        'هلندی ها عادت دارند قهوه خود را با کمی شیر و چای را برخلاف بریتانیایی ها بدون شیر بنوشند',
        'تصور می رود ماده فلاونوید موجود در چای، عامل اصلی در کاهش خطر ابتلا به بیمارهای قلبی است',
        'تهیه کنندگان گزارش در مورد این که آیا شیر تاثیر فلاونوید را کاهش می دهد یا نه به نتیجه قاطعی نرسیده اند',
        'ولی قهوه دارای موادی است که می تواند همزمان این خطر را کاهش یا افزایش دهد چون از یک سو قادر است به طور بالقوه، میزان کلسترول خون را بالا ببرد و در همین حال از خطر التهاب که با بیماری قلبی ارتباط داده شده، بکاهد',
        'الین میسون، از بنیاد قلب بریتانیا می گوید: "مطالعات به عمل آمده تقویت کننده این فرضیه است که نوشیدن قهوه و چای در حد متعارف، برای بیشتر مردم بی ضرر است و حتی خطر ابتلا به بیماری قلبی یا مرگ در اثر این بیماری را کاهش می دهد',
        'الین میسون می افزاید: " ولی کشیدن یک سیگار همراه با قهوه، تمام این منافع را از بین می برد. علاوه بر این بعید به نظر می رسد که نوشیدن مقدار زیادی چای در حالی که شخص ساعت ها روی صندلی راحتی لم داده و تلویزیون تماشا می کند، به محفاظت از قلب کمک چندانی بکند',
    ]

    tajik_equals_sentences_shuffled = [
        'Чой ва қаҳва хатари бемориҳои қалбиро коҳиш медиҳад',
        'Шавоҳиди тоза нишон медиҳад, ки ашхосе, ки дар рӯз чандин финҷон чой ё қаҳва менӯшанд, камтар эҳтимол дорад ба бемории қалбӣ мубтало шаванд',
        'Ин шавоҳид ҳосили сенздаҳ соли мутолеъа бар рӯйи чиҳил ҳазор нафар дар Ҳуланд аст',
        'Бино бар гузорише, ки дар ин бора дар нашрияи пизишкии American Heart Association интишор ёфта дар касоне ки дар рӯзбеш аз шаш финҷон чой менӯшад, хатари ибтило ба бемориҳои қалбӣ як севум коҳиш меёбад',
        'Масрафи қаҳва низ то ҳудуде ба коҳиши эҳтимоли мубтало шудан ба нороҳатиҳои қалбӣ кумак мекунад',
        'Хатари мубтало шудан ба бемориҳои қалбӣ дар касоне, ки рӯзона ду то чаҳор финҷон қаҳва менӯшанд, дар муқоиса бо касоне, ки одат ба нӯшидани қаҳва надоранд, бист дарсад камтар аст',
        'Кашидани сигор таъсири мусбати нӯшидани чой ва қаҳваро аз байн мебарад',
        'Вале асари мусбати нӯшидани чой ва қаҳва дар сурати масрафи беш аз андоза аз байн меравад',
        'Илова бар ин кашидани сигор низ тамоми асароти мусбати чой ва қаҳваро хунсо мекунад',
        'Ҳуландиҳо одат доранд қаҳваи худро бо каме шир ва чойро бар хилофи бритониё бидуни шир бинӯшанд',
        'Таҳиякунандагони гузориш дар мавриди ин, ки оё шир таъсири антиоксидант-полифенолро коҳиш медиҳад ё на ба натиҷаи қотеъе нарасидаанд',
        'Тасаввур меравад моддаи антиоксидант-полифенол дар чой, омили аслӣ дар коҳиши хатари ибтило ба бемориҳои қалбӣ аст',
        'Вале қаҳва дорои маводде аст, ки метавонад ҳамзамон ин хатарро коҳиш ё афзоиш диҳад, чун аз як сӯ қодир аст ба таври билқувва, мизони кулеструл (холестрол)-и хунро боло бибиарад ва дар ҳамин ҳол аз хатари илтиҳоб, ки бо бемории қалбӣ иртибот дода шуда, бикоҳад',
        'Эллен Мейсон меафзояд: “Вале кашидани як сигор ҳамроҳ бо қаҳва тамоми ин манофеъро аз байн мебарад. Илова бар ин баъид ба назр мерасад, ки нӯшидани миқдори зиёде чой дар ҳоле ки шахс соъатҳо рӯйи сандалии роҳате лам дода ва телевизиюн тамошо мекунад ба муҳофизат аз қалб кумаки чандоне бикунад',
        'Эллен Мейсон, аз бунёди қалби Бритониё мегӯяд: “Мутолеъоти ба амал омада тақвияткунандаи ин фарзия аст, ки нӯшидани қаҳва ва чой дар ҳадди мутаъориф барои бештари мардум безарар аст ва ҳатто хатари ибтило ба бемории қалбӣ ё марг дар асари ин бемориро коҳиш медиҳад',
    ]

    print(list(map(lambda x: x['match'], TjPersChecker.match_sentances(tajik_equals_sentences_shuffled, pers_equals_sentences_shuffled))))   