from Levenshtein import ratio
from parsivar import Normalizer

class TjPersChecker:
    _tj_let = 'б г д з з з к л м н п р с с с т ф х ч ж ш ғ қ ҳ ҷ'.split()
    _pers_let = [Normalizer().normalize(x) for x in 'ب گ د ﺽ ﺫ ﺯ ک ل م ن پ ر ﺙ ﺹ ﺱ ﺕ ف خ چ ژ ش غ ق ه ج'.split()]

    @staticmethod
    def str_changer(tokens: str, lang: str) -> str:
        changed_str = []
        if lang == "tj":
            for l in tokens:
                if l.lower() in TjPersChecker._tj_let:
                    changed_str.append(l.lower())
        elif lang == "pers":
            for l in tokens:
                if l in TjPersChecker._pers_let:
                    l = TjPersChecker._tj_let[TjPersChecker._pers_let.index(l)]
                    changed_str.append(l)
        return "".join(changed_str)

    @staticmethod
    def check(tj_sentence: str, pers_sentence: str) -> float:
        return ratio(TjPersChecker.str_changer(tj_sentence, lang="tj"), TjPersChecker.str_changer(pers_sentence, lang="pers"))
    
    @staticmethod
    def check_lists(tj_sentences: list[str], pers_sentences: list[str]) -> list[float]:
        return [TjPersChecker.check(tj_sentence=tj_sen, pers_sentence=per_sen) for tj_sen, per_sen in zip(tj_sentences, pers_sentences)]
    

if __name__ == '__main__':
    
    pers_equals_sentences = [
        'چای و قهوه خطر بیماری های قلبی را کاهش می دهد',
        'شواهد تازه نشان می دهد که اشخاصی که در روز چندین فنجان چای یا قهوه می نوشند کمتر احتمال دارد به بیماری های قلبی مبتلا شوند',
        'این شواهد حاصل سیزده سال مطالعه بر روی چهل هزار نفر در هلند است',
        'بنا بر گزارشی که در این باره در نشریه پزشکی American Heart Association انتشار یافته، در کسانی که در روز بیش از شش فنجان چای می نوشند، خطر ابتلا به بیماری های قلبی یک سوم کاهش می یابد',
        'مصرف قهوه نیز تا حدودی به کاهش احتمال مبتلا شدن به ناراحتی های قلبی کمک می کند'
        'خطر مبتلا شدن به بیماری های قلبی در کسانی که روزانه دو تا چهار فنجان قهوه می نوشند، در مقایسه با کسانی که عادت به نوشیدن قهوه ندارند، بیست در صد کمتر است',
        'کشیدن سیگار تاثیر مثبت نوشیدن چای و قهوه را از بین می برد',
        'ولی اثر مثبت نوشیدن چای و قهوه در صورت مصرف بیش از اندازه از بین می رود',
        'علاوه بر این کشیدن سیگار نیز تمام اثرات مثبت چای و قهوه را خنثی می کند',
        'هلندی ها عادت دارند قهوه خود را با کمی شیر و چای را برخلاف بریتانیایی ها بدون شیر بنوشند',
        'تهیه کنندگان گزارش در مورد این که آیا شیر تاثیر فلاونوید را کاهش می دهد یا نه به نتیجه قاطعی نرسیده اند',
        'تصور می رود ماده فلاونوید موجود در چای، عامل اصلی در کاهش خطر ابتلا به بیمارهای قلبی است',
        'ولی قهوه دارای موادی است که می تواند همزمان این خطر را کاهش یا افزایش دهد چون از یک سو قادر است به طور بالقوه، میزان کلسترول خون را بالا ببرد و در همین حال از خطر التهاب که با بیماری قلبی ارتباط داده شده، بکاهد',
        'الین میسون، از بنیاد قلب بریتانیا می گوید: "مطالعات به عمل آمده تقویت کننده این فرضیه است که نوشیدن قهوه و چای در حد متعارف، برای بیشتر مردم بی ضرر است و حتی خطر ابتلا به بیماری قلبی یا مرگ در اثر این بیماری را کاهش می دهد'
        'الین میسون می افزاید: " ولی کشیدن یک سیگار همراه با قهوه، تمام این منافع را از بین می برد. علاوه بر این بعید به نظر می رسد که نوشیدن مقدار زیادی چای در حالی که شخص ساعت ها روی صندلی راحتی لم داده و تلویزیون تماشا می کند، به محفاظت از قلب کمک چندانی بکند'
    ]

    tajik_equals_sentences = [
        'Чой ва қаҳва хатари бемориҳои қалбиро коҳиш медиҳад',
        'Шавоҳиди тоза нишон медиҳад, ки ашхосе, ки дар рӯз чандин финҷон чой ё қаҳва менӯшанд, камтар эҳтимол дорад ба бемории қалбӣ мубтало шаванд',
        'Ин шавоҳид ҳосили сенздаҳ соли мутолеъа бар рӯйи чиҳил ҳазор нафар дар Ҳуланд аст',
        'Бино бар гузорише, ки дар ин бора дар нашрияи пизишкии American Heart Association интишор ёфта дар касоне ки дар рӯзбеш аз шаш финҷон чой менӯшад, хатари ибтило ба бемориҳои қалбӣ як севум коҳиш меёбад',
        'Масрафи қаҳва низ то ҳудуде ба коҳиши эҳтимоли мубтало шудан ба нороҳатиҳои қалбӣ кумак мекунад',
        'Хатари мубтало шудан ба бемориҳои қалбӣ дар касоне, ки рӯзона ду то чаҳор финҷон қаҳва менӯшанд, дар муқоиса бо касоне, ки одат ба нӯшидани қаҳва надоранд, бист дарсад камтар аст',
        'Кашидани сигор таъсири мусбати нӯшидани чой ва қаҳваро аз байн мебарад',
        'Вале асари мусбати нӯшидани чой ва қаҳва дар сурати масрафи беш аз андоза аз байн меравад',
        'Илова бар ин кашидани сигор низ тамоми асароти мусбати чой ва қаҳваро хунсо мекунад',
        'Ҳуландиҳо одат доранд қаҳваи худро бо каме шир ва чойро бар хилофи бритониё бидуни шир бинӯшанд',
        'Таҳиякунандагони гузориш дар мавриди ин, ки оё шир таъсири антиоксидант-полифенолро коҳиш медиҳад ё на ба натиҷаи қотеъе нарасидаанд',
        'Тасаввур меравад моддаи антиоксидант-полифенол дар чой, омили аслӣ дар коҳиши хатари ибтило ба бемориҳои қалбӣ аст',
        'Вале қаҳва дорои маводде аст, ки метавонад ҳамзамон ин хатарро коҳиш ё афзоиш диҳад, чун аз як сӯ қодир аст ба таври билқувва, мизони кулеструл (холестрол)-и хунро боло бибиарад ва дар ҳамин ҳол аз хатари илтиҳоб, ки бо бемории қалбӣ иртибот дода шуда, бикоҳад',
        'Эллен Мейсон, аз бунёди қалби Бритониё мегӯяд: “Мутолеъоти ба амал омада тақвияткунандаи ин фарзия аст, ки нӯшидани қаҳва ва чой дар ҳадди мутаъориф барои бештари мардум безарар аст ва ҳатто хатари ибтило ба бемории қалбӣ ё марг дар асари ин бемориро коҳиш медиҳад',
        'Эллен Мейсон меафзояд: “Вале кашидани як сигор ҳамроҳ бо қаҳва тамоми ин манофеъро аз байн мебарад. Илова бар ин баъид ба назр мерасад, ки нӯшидани миқдори зиёде чой дар ҳоле ки шахс соъатҳо рӯйи сандалии роҳате лам дода ва телевизиюн тамошо мекунад ба муҳофизат аз қалб кумаки чандоне бикунад'
    ]

    print(TjPersChecker.check_lists(tj_sentences=tajik_equals_sentences, pers_sentences=pers_equals_sentences))
